RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_syscfg.h
/* I/O compensation cell enable/disable */
#define SYSCFG_IO_COMPENSATION_ENABLE       ((uint32_t)0x00000001U)                     /*!< I/O compensation cell enable */
#define SYSCFG_IO_COMPENSATION_DISABLE      ((uint32_t)0x00000000U)                     /*!< I/O compensation cell disable */

/* module lockup */
#define SYSCFG_LVD_LOCKUP                   SYSCFG_LKCTL_LVD_LOCK                       /*!< LVD signal connected */
#define SYSCFG_CPU_LOCKUP                   SYSCFG_LKCTL_CPU_LOCK                       /*!< CPU lockup signal connected */
#define SYSCFG_BKPRAM_LOCKUP                SYSCFG_LKCTL_BKPRAM_LOCK                    /*!< Region 2 backup SRAM ECC double error signal connected */
#define SYSCFG_SRAM1_LOCKUP                 SYSCFG_LKCTL_SRAM1_LOCK                     /*!< Region 1 SRAM1 ECC double error signal connected */
#define SYSCFG_SRAM0_LOCKUP                 SYSCFG_LKCTL_SRAM0_LOCK                     /*!< Region 1 SRAM0 ECC double error signal connected */
#define SYSCFG_DTCM_LOCKUP                  SYSCFG_LKCTL_DTCM_LOCK                      /*!< Region 0 DTCM ECC double error signal connected */
#define SYSCFG_ITCM_LOCKUP                  SYSCFG_LKCTL_ITCM_LOCK                      /*!< Region 0 ITCM-RAM ECC double error signal connected */
#define SYSCFG_AXIRAM_LOCKUP                SYSCFG_LKCTL_AXIRAM_LOCK                    /*!< Region 0 AXI-SRAM ECC double error signal connected */

/* SYSCFG compensation flag definitions */
#define SYSCFG_FLAG_IO_LOW_VOLTAGE          SYSCFG_CPSCTL_IOLV                          /*!< I/O in low voltage state flag, product supply voltage is working below 2.5V */
#define SYSCFG_FLAG_COMPENSATION_READY      SYSCFG_CPSCTL_CPS_RDY                       /*!< I/O compensation cell ready flag */

/* SYSCFG interrupt definitions */
#define SYSCFG_INT_INEXACT                  SYSCFG_CFPUINTEN_IXIE                       /*!< inexact interrupt */
#define SYSCFG_INT_INPUT_ABNORMAL           SYSCFG_CFPUINTEN_IDIE                       /*!< input abnormal interrupt */
#define SYSCFG_INT_OVERFLOW                 SYSCFG_CFPUINTEN_OVFIE                      /*!< overflow interrupt */
#define SYSCFG_INT_UNDERFLOW                SYSCFG_CFPUINTEN_UFIE                       /*!< underflow interrupt */
#define SYSCFG_INT_DIV0                     SYSCFG_CFPUINTEN_DZIE                       /*!< divide-by-zero interrupt */
#define SYSCFG_INT_INVALID_OPERATION        SYSCFG_CFPUINTEN_IOPIE                      /*!< invalid operation interrupt */
#define SYSCFG_INT_CPU_DCDET                SYSCFG_CFPUINTEN_CPU_DCDETIE                /*!< CPU DCACHE error bank information interrupt */
#define SYSCFG_INT_CPU_ICDET                SYSCFG_CFPUINTEN_CPU_ICDETIE                /*!< CPU ICACHE error detection information interrupt */

/* BOOT modes definitions */
#define BOOT_SRAM                           ((uint32_t)0x00000000U)                     /*!< BOOT from SRAM (ITCM/DTCM/RAM shared/AXI SRAM) */
#define BOOT_SECURITY                       ((uint32_t)0x00000001U)                     /*!< BOOT from Security */
#define BOOT_SYSTEM                         ((uint32_t)0x00000002U)                     /*!< BOOT_SYS (BootLoader) */
#define BOOT_USER                           ((uint32_t)0x00000003U)                     /*!< BOOT_USER (NVMC / OSPI0/1) */

/* BOR threshold level definitions */
#define BOR_OFF                             ((uint32_t)0x00000000U)                     /*!< no BOR function */
#define BOR_THRESHOLD_VAL1                  ((uint32_t)0x00000001U)                     /*!< BOR threshold value 1 */
#define BOR_THRESHOLD_VAL2                  ((uint32_t)0x00000002U)                     /*!< BOR threshold value 2 */
#define BOR_THRESHOLD_VAL3                  ((uint32_t)0x00000003U)                     /*!< BOR threshold value 3 */

/* EtherCat internal eeprom size polarity select definition */
#define ESC_INTERNAL_EEPROM_SIZE1           ((uint32_t)0x00000000U)                     /*!< Select internal EEPROM size is 1k~15k bit */
#define ESC_INTERNAL_EEPROM_SIZE2           SYSCFG_ESCCFG0_EEPROMSZ                     /*!< Select internal EEPROM size is 16k~4M bit */

/* EtherCat linkactled0 polarity select definition */
#define ESC_LINKACTLED0_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled0 output 0 */
#define ESC_LINKACTLED0_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED0_POLSEL           /*!< EtherCat linkactled0 output 1 */

/* EtherCat linkactled1 polarity select definition */
#define ESC_LINKACTLED1_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled1 output 0 */
#define ESC_LINKACTLED1_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED1_POLSEL           /*!< EtherCat linkactled1 output 1 */

/* EtherCat linkactled2 polarity select definition */
#define ESC_LINKACTLED2_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled2 output 0 */
#define ESC_LINKACTLED2_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED2_POLSEL           /*!< EtherCat linkactled2 output 1 */

/* EtherCat led_err polarity select definition */
#define ESC_LEDERR_POL_LOW                  ((uint32_t)0x00000000U)                     /*!< EtherCat lederr output 0 */
#define ESC_LEDERR_POL_HIGH                 SYSCFG_ESCCFG0_LEDERR_POLSEL                /*!< EtherCat lederr output 1 */

/* EtherCat led_run polarity select definition */
#define ESC_LEDRUN_POL_LOW                  ((uint32_t)0x00000000U)                     /*!< EtherCat ledrun output 0 */
#define ESC_LEDRUN_POL_HIGH                 SYSCFG_ESCCFG0_LEDRUN_POLSEL                /*!< EtherCat ledrun output 1 */

/* EtherCat reset_out polarity select definition */
#define ESC_RSTOUT_POL_HIGH                 ((uint32_t)0x00000000U)                     /*!< EtherCat reset_out output 1 */
#define ESC_RSTOUT_POL_LOW                  SYSCFG_ESCCFG0_RSTOUT_POLSEL                /*!< EtherCat reset_out output 0 */

/* EtherCat LINK0 polarity select definition */
#define ESC_LINK0_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK0 output 1 */
#define ESC_LINK0_POL_LOW                   SYSCFG_ESCCFG0_NLINK0_POLSEL                /*!< EtherCat LINK0 output 0 */

/* EtherCat LINK1 polarity select definition */
#define ESC_LINK1_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK1 output 1 */
#define ESC_LINK1_POL_LOW                   SYSCFG_ESCCFG0_NLINK1_POLSEL                /*!< EtherCat LINK1 output 0 */

/* EtherCat LINK2 polarity select definition */
#define ESC_LINK2_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK2 output 1 */
#define ESC_LINK2_POL_LOW                   SYSCFG_ESCCFG0_NLINK2_POLSEL                /*!< EtherCat LINK2 output 0 */

/* EtherCat port0 phy address select definition */
#define ESC_PHY_ADDRESS_OFFSET_0            ((uint32_t)0x00000000U)                     /*!< port0 phy address offset is 0 */
#define ESC_PHY_ADDRESS_OFFSET_16           SYSCFG_ESCCFG0_PHY_OFFSETSEL                /*!< port0 phy address offset is 16 */

/* EtherCat mii or rmii select definition */
#define ESC_MII                             ((uint32_t)0x00000000U)                     /*!< esc mii */
#define ESC_RMII                            SYSCFG_ESCCFG0_RMIIEN                       /*!< esc rmii */

/* EtherCat SMPS_DRIVE's drive capability definition */
#define ESC_SMPS_DRIVE_CAP_NORMAL           ((uint32_t)0x00000000U)                     /*!< Drive capability is normal */
#define ESC_SMPS_DRIVE_CAP_REDUCED          SYSCFG_ESCCFG0_SMPS_DRIVE                   /*!< Drive capability is reduced */

/* rmii0 txshift0 selection */
#define RMII0_TXSHIFT0(regval)              (BITS(1,2)&((uint32_t)(regval)<<1))
#define ESC_RMII0_TXSHIFT0_0NS              RMII0_TXSHIFT0(0)                           /*!< rmii0 txshift value is 0ns */
#define ESC_RMII0_TXSHIFT0_10NS             RMII0_TXSHIFT0(1)                           /*!< rmii0 txshift value is 10ns */
#define ESC_RMII0_TXSHIFT0_20NS             RMII0_TXSHIFT0(2)                           /*!< rmii0 txshift value is 20ns */
#define ESC_RMII0_TXSHIFT0_30NS             RMII0_TXSHIFT0(3)                           /*!< rmii0 txshift value is 30ns */

